stko/oobd/trunk/interface/Designs/CORTEX/STM32F103C8_Eclipse_GCC/D2/app/src/SystemConfig.c
    /* Enable the USART1-Receive interrupt: this interrupt is generated when the
       USART1 receive data register is not empty */
    USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);

    NVIC_Configuration();

    /* set UartAutobaudControl to default UART value 115200kbit/s */
    BTM222_UartAutobaudControl = 0;

    USART_SendData(USART1, '\r');	/* clear command line from Bootloader String first */
    for (nCount = 0; nCount < 9000000; nCount++) {
    };				/* delay for waiting of BTM182/BTM222 power up */

    while (BTM222_UartAutobaudControl != 9) {
	USART_SendData(USART1, 'a');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */

	USART_SendData(USART1, 't');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */

	USART_SendData(USART1, '\r');
	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	for (nCount = 0; nCount < 150000; nCount++) {
	};			/* delay */
	BufCnt = 0;
	BTM222_UART_Rx_Flag = pdFALSE;

	USART_SendData(USART1, 'a');

	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 't');

	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, 'l');

	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '?');

	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */
	USART_SendData(USART1, '\r');

	for (nCount = 0; nCount < nLength; nCount++) {
	};			/* delay */

	for (nCount = 0; nCount < 500000; nCount++) {
	};			/* delay */

	/* check received response character from BTM222 */
	switch (BTM222_UartSpeed) {

	case '0':
	    DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 4800bps detected! ***");
	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */
	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */
	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    break;

	case '1':

	    DEBUGUARTPRINT("\r\n*** BTM222 - L1 = 9600bps detected! ***");

	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    break;

	case '2':

	    DEBUGUARTPRINT("\r\n*** BTM222 - L2 = 19200bps detected! ***");

	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    break;

	case '3':

	    DEBUGUARTPRINT("\r\n*** BTM222 - L3 = 38400bps detected! ***");

	    BTM222_UART_Rx_Flag = pdFALSE;

	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    BTM222_UART_Rx_Flag = pdTRUE;

	    break;

	case '4':

	    DEBUGUARTPRINT("\r\n*** BTM222 - L4 = 57600bps detected! ***");

	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    break;

	case '5':

	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L5 = 115200bps detected! ***");

	    BTM222_UartAutobaudControl = 9;

	    break;

	case '6':

	    DEBUGUARTPRINT
		("\r\n*** BTM222 - L6 = 230400bps detected! ***");

	    USART_SendData(USART1, 'a');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 't');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, 'l');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '5');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    USART_SendData(USART1, '\r');

	    for (nCount = 0; nCount < nLength; nCount++) {
	    }
	    ;			/* delay */

	    BTM222_UartAutobaudControl = 6;

	    break;

